app/views/books/show.html.erb

            <% if @book.favorited_by?(current_user) %>
            <p><%= link_to @book.favorites.count, book_favorites_path(@book), method: :delete, class: "fas fa-heart heart_red" %></p>
            <% else %>
            <p><%= link_to @book.favorites.count, book_favorites_path(@book), method: :post, class: "fas fa-heart heart_blue" %></p>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

          </td>
          <td>コメント数: <% @book.book_comments.count %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

      <table>
        <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]