app/controllers/books_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
  def index
    @user = User.find(current_user.id)
    @books = Book.all