app/controllers/search_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE'あさお%')
SELECT "books".* FROM "books" WHERE (title LIKE'%本%')
---
  def search
    @model = params[:model]
    content = params[:content]
    search = params[:search]
    if @model == 'user'
      @user = User.search(search, content)
    else
      @book = Book.search(search, content)